{
  "header": [
    {
      "name": "Jin Seok (James) Park",
      "address": "",
      "email": "james.park@emory.edu",
      "phone": "+1 (470) 920-0719",
      "website": [
        "linkedin.com/in/jin-seok-park",
        "github.com/jspgr33n"
      ]
    }
  ],
  "education": [
    {
      "school": "Emory University, Emory College of Arts and Sciences",
      "degree": "Bachelor of Science in Quantitative Sciences: Informatics / Minor in Spanish",
      "start": "",
      "end": "May 2025",
      "gpa": "3.62/4.0",
      "details": [
        "Relevant Courses: ML, AI, Prob. & Stats, Stat. Computing, DB Sys., Regression Analysis, Stat. Computing w/ Python & R"
      ]
    }
  ],
  "experience": [
    {
      "company": "Atlanta Regional Commission (ARC)",
      "position": "QTM Data Science for Social Good Practicum Fellowship",
      "location": "Atlanta, GA",
      "start": "Jun 2023",
      "end": "Aug 2023",
      "description": [
        "Forecasted population growth until 2050 utilizing Python and R, analyzing migration trends with Census, ACS, and Tax data to aid ARC in efficient fund distribution across Metro Atlanta's 11 counties.",
        "Improved current forecasting model accuracy by 60%, identifying proxies that significantly enhanced model performance.",
        "Utilized Python, R, Excel, GCP for data collection, visualization, analysis, and linear regression."
      ]
    },
    {
      "company": "Better Business Bureau of North Georgia (BBB)",
      "position": "QTM DataThink Program Fellowship",
      "location": "Atlanta, GA",
      "start": "Sep 2022",
      "end": "Apr 2023",
      "description": [
        "Investigated membership trends using SQL and R, pitching insights with Tableau visualizations to increase retention rate, reducing customer and membership churn by ~6%.",
        "Employed SQL, R, Excel, Tableau, ggplot2, dplyr for data visualization, analysis, and business intelligence."
      ]
    }
  ],
  "projects": [
    {
      "name": "Research: Gathering Expert Opinions for Poverty-Alleviation",
      "description": [
        "Developed statistical tools to compile expert opinions from academic, non-profit, and government sectors for the Gates Foundation's social investment plans, gathering 3000+ NGO information in Bangladesh, Pakistan, and India."
      ],
      "technologies": [
        "Python",
        "R",
        "HTML",
        "Amazon Turk",
        "Web Scraping",
        "Data Collection",
        "Data Analysis",
        "Data Visualization"
      ]
    },
    {
      "name": "Machine Learning: Cyber Harassment Detection",
      "description": [
        "Preprocessed 48000+ text values from Kaggle, training and hyperparameter tuning models for binary classification of cyberbullying to determine the most effective machine learning algorithm for cyber harassment detection.",
        "Achieved 99% accuracies for BERT-base models with great precision and recall, justifying models' effectiveness."
      ],
      "technologies": [
        "Python",
        "R",
        "KNN",
        "Decision Tree",
        "Logistic Reg.",
        "BERT-base",
        "Word2Vec",
        "Scikit-learn",
        "Tensorflow",
        "PyTorch"
      ]
    },
    {
      "name": "Game Development: Poro Party (watch the trailer here!)",
      "description": [
        "Created a multiplayer (unlimited players) web-based party-style game with cute cat characters, physics, mini-games, and music using web sockets and Phaser3 HTML game framework for fun anywhere."
      ],
      "technologies": [
        "JavaScript",
        "HTML",
        "NodeJS",
        "Phaser3",
        "Socket.io",
        "Heroku",
        "Agile Framework",
        "Scrum",
        "Game Framework"
      ]
    },
    {
      "name": "Data Analysis: DataFest Hackathon 2023 Best Insight Award",
      "description": [
        "Explored the American Bar Association's Free Legal Answers client categorization system, resolving inefficiency of pro bono legal expert availability and reducing overall time, improving website categorization efficiency by 40%."
      ],
      "technologies": [
        "Python",
        "R",
        "NLP",
        "Machine Learning",
        "Keyword Extraction",
        "Word Embedding",
        "K-Means Clustering"
      ]
    }
  ],
  "extracurriculars": [
    {
      "organization": "QTM Ambassador • Department of Quantitative Theory & Methods (QTM), Emory University",
      "position": "",
      "location": "",
      "start": "Jun 2023",
      "end": "Present",
      "description": [
        "Mentored over 300+ undergrad QTM students on classes and guided their educational and professional tracks.",
        "Represented the department, moderated and hosted events for undergrad/grad QTM students, alumni, and advisory board."
      ]
    },
    {
      "organization": "Leadership Experience Advising Program (LEAP) Chair • Asian Student Organization",
      "position": "",
      "location": "",
      "start": "May 2023",
      "end": "Present",
      "description": [
        "Directed weekly LEAP meetings for underclassmen, engaging dialogue on Asian and Asian American issues.",
        "Spearheaded Asian cultural events and orchestrated workshops for Emory University and other Georgia colleges."
      ]
    },
    {
      "organization": "Emory Robotics",
      "position": "Secretary",
      "location": "",
      "start": "Apr 2022",
      "end": "Present",
      "description": [
        "Pioneered a workspace for students to work on robotics projects and build/train for VEX U Robotics competitions.",
        "Recruited 200+ members and hosted workshops on engineering principles, hands-on building, and programming."
      ]
    }
  ],
  "other": [
    {
      "title": "Activities",
      "content": [
        "Emory Crew Varsity Rower",
        "Emory Pep Band Alto-Sax",
        "Emory Iberian Studies Program (Spain Study Abroad)"
      ]
    },
    {
      "title": "Languages",
      "content": [
        "Fluent: English, Korean",
        "Intermediate: Spanish"
      ]
    },
    {
      "title": "Hobbies & Interests",
      "content": [
        "Gaming (League of Legends)",
        "Playing Instruments (Guitar, Ukulele, Drums)",
        "Skateboarding",
        "Eating!"
      ]
    }
  ]
}