{
    "education": [
        "Emory University, Goizueta Business School      \nBachelor of Business Administration, Strategy & Management Consulting, Double Major: Economics \nCumulative GPA: 3.6/4.0 \nDean’s List Fall 2022 and Spring 2023, Phi Eta Sigma—a freshman honor society \nRelevant Courses: Leading & Managing Change, Competitive Advantage, Negotiations, Decision Tools & Visualization ",
        "       Atlanta, GA \n           May 2025 ",
        "Emory University, Oxford College \nAssociate of Arts  ",
        "       Oxford, GA \n          May 2023 ",
        "University of Economics  \nRelevant Courses: International Management, Supply Chain, Operations Research ",
        "             Prague, Czech Republic \n                            Fall 2022"
    ],
    "work_experience": [
        "Emory University, Goizueta Business School   \nTeaching Assistant, Organization & Management    \n  Lead content review sessions for groups of 20 to 30 students to enhance learning in introductory consulting course \n  Review student assignments for three class sections and provide written feedback to clarify concepts ",
        "        Atlanta, GA \n                       Aug. 2023 – Present  ",
        "        Virtual & In-Person, New York, NY \nAmerican Express, Global Merchant Services  \n     Jun. 2023 – Aug. 2023 \nPayment Security & Emerging Payments Intern \n  Created  and  provided  recommendations  for  new  forecasting methodologies  of  Discount  Business  Volume models, \nwhich account for over 70% of AMEX revenue, resulting in improved accuracy and streamlining of monthly processes  \n  Assessed Canadian volumes by city, industry, and economic factors to explain trends and isolate areas of growth and ",
        "decline; communicated insights to business teams to help guide their business strategy  ",
        "  Analyzed and calculated the dollar impact of catastrophic events such as the Oklahoma tornadoes and Calgary floods ",
        "WellCare Health Plans   \nFinance & Planning Analyst Intern  \n  Performed cost analysis of the company’s paper consumption and designed initiatives to save $50K in year one \n  Oversaw a team of five interns for three pilot Micro Market locations; process included contracting bids, negotiating ",
        "                                Virtual \n    Jun. 2022 – Aug.  2022 ",
        "with vendors, and developing satisfaction surveys for 4,000 associates   ",
        "  Developed a transformation initiative for all current vending machines to have 35% healthy choice items"
    ],
    "leadership_community_involvement": [
        "Project Shine of Emory University, Site Coordinator, Volunteer ESL Tutor  \n  Utilize Spanish language skills to teach English to diverse groups of 5-30 immigrants and refugees of all ages \n  Coordinate 15 volunteers and organized monthly reflection meetings to promote cultural awareness ",
        "                       Aug. 2022 – Present ",
        "John R. Lewis Case Competition, Team Member  \n  Collaborated with six team members to address racial justice issues for a Fortune 300 company  \n  Employed research methods to offer approaches the company can take to be more diverse and inclusive  ",
        "      Oct. 2022– Feb. 2023  ",
        "Undergraduate Business Student Leadership Conference (UBSLC), Registration Chair                       Dec. 2022– Feb. 2023 \n  Communicated with 42 top business schools around the world to increase level of attendance by 22% \n  Managed a database of 82 participants’ payment and arrival information to facilitate conference logistics"
    ],
    "additional_information": "Other Activities: Emory Varsity Basketball, Emory Student Ambassador, ASCEND, Volunteer Emory \nHonors & Awards: Eagle Scout, Student Ambassador of the Year, Business Research Certification \nSkills: Proficient in MS Office, Risk Optimizer, LexusNexus, Java, Bloomberg Terminal, Google AdWords; Spanish (Fluent) \nInterests: Baking, travel (Spain, Brazil, London), piano, triathlons (Ironman 70.3 Miami)"
}