{
    "header": {
        "name": "Andrew Lu",
        "address": "1762 Clifton Rd NE MSC 221290, Atlanta, GA 30322",
        "email": "andrew.lu@emory.edu",
        "phone": "(404) 786-6427",
        "website": [
            "andrewtlu.github.io",
            "www.boredbutton.com"
        ]
    },
    "education": [
        {
            "school": "Emory University",
            "degree": "Bachelor of Science in Computer Science, Minor in Applied Math",
            "graduation": "August 2022 -- Present",
            "gpa": "4.0/4.0",
            "details": [
                "Dean's List: Fall 2022, Spring 2023, Fall 2023",
                "Relevant Coursework: Data Structures and Algorithms, Computer Architecture, Algorithms, Linear Algebra, Machine Learning, Computational Linguistics, Data Mining, Practicum",
                "Awards/Distinctions: Phi Eta Sigma Honor Society, National Merit Scholar"
            ]
        }
    ],
    "experience": [
        {
            "company": "Emory Libraries, Computing Center at Cox Hall",
            "position": "Computing Center Technology Consultant",
            "location": "Atlanta, GA",
            "start": "August 2023",
            "end": "Present",
            "description": [
                "Fostered a friendly and efficient environment by managing the Computing Center's audiovisual system, ensuring seamless operation for students and faculty.",
                "Delivered a secure and up-to-date online experience for over 200 students by maintaining and servicing 32 computers and 4 printers, ensuring optimal performance and availability."
            ]
        },
        {
            "company": "Kerygma Digital",
            "position": "Software Engineer",
            "location": "Remote",
            "start": "June 2023",
            "end": "July 2023",
            "description": [
                "Optimized the service response latency by 60% (~400 ms) by implementing a custom configurable time-to-live HTTP cache, enhancing the responsiveness for over 5 million BibleBot users across 60,000+ Discord servers.",
                "Reduced HTML and JSON cache usage by 99% and 39%, respectively, by creating custom middleware to efficiently strip stored responses, improving overall performance.",
                "Leveraged knowledge in Java, MVC, REST, and Git to quickly adapt and contribute to the C# ASP.NET framework, demonstrating versatility and a strong learning aptitude."
            ]
        }
    ],
    "projects": [],
    "extracurriculars": [
        {
            "organization": "Project Emory",
            "position": "Cofounder/Secretary",
            "location": "Atlanta, GA",
            "start": "May 2023",
            "end": "Present",
            "description": [
                "Crafted an engaging Spring Boot, MongoDB, and Git curriculum to enhance the technical proficiency of over 20 members, fostering their growth and development.",
                "Provided hands-on software engineering experience to over 30 students by establishing and managing Emory's only open project-building club, bridging the gap between theory and practice.",
                "Mentored two computer science students by offering peer-programming opportunities, coursework guidance, and pre-professional advice, contributing to their overall success in software engineering."
            ]
        },
        {
            "organization": "Emory Hack4Impact",
            "position": "Software Engineer",
            "location": "Atlanta, GA",
            "start": "December 2023",
            "end": "Present",
            "description": [
                "Designed and developed an internal operations webpage, including an announcements board, HR service page, personal dashboard, and resources page, to provide the Odyssey Family Consulting Center with a unified employee experience.",
                "Leveraged Figma to design visually appealing pages based on client specifications and JavaScript to implement the desired functionality, ensuring a seamless user experience."
            ]
        }
    ],
    "other": [
        {
            "title": "Software",
            "content": [
                "(proficient): Java, Git, JavaScript/TypeScript, HTML/CSS, Python",
                "(familiar): Shell, C, C#, Go"
            ]
        },
        {
            "title": "Interests",
            "content": [
                "Backpacking",
                "Volleyball",
                "Technical/Modded Minecraft",
                "Linux",
                "Performance Arts (Oboe and Guitar)"
            ]
        }
    ]
}