{
    "header": {
        "name": "Andrew Lu",
        "address": "1762 Clifton Rd NE MSC 221290, Atlanta, GA 30322",
        "email": "andrew.lu@emory.edu",
        "phone": "(404) 786-6427",
        "website": "andrewtlu.github.io"
    },
    "education": [
        {
            "school": "Emory University",
            "degree": "Bachelor of Science in Computer Science, Minor in Applied Math",
            "graduation": "August 2022 -- Present",
            "gpa": "4.0/4.0",
            "details": [
                "Dean's List: Fall 2022, Spring 2023, Fall 2023",
                "Relevant Coursework: Data Structures and Algorithms, Computer Architecture, Algorithms, Linear Algebra, Machine Learning, Computational Linguistics, Data Mining, Practicum",
                "Awards/Distinctions: Phi Eta Sigma Honor Society, National Merit Scholar"
            ]
        }
    ],
    "experience": [
        {
            "company": "Emory Libraries, Computing Center at Cox Hall",
            "position": "Computing Center Technology Consultant",
            "location": "Atlanta, GA",
            "start": "August 2023",
            "end": "Present",
            "description": [
                "Maintained a friendly environment by managing CCCH's A/V system, ensuring a seamless experience for students and faculty.",
                "Provided a secure and up-to-date online experience for over 200 students by servicing CCCH's 32 computers and 4 printers, ensuring reliable access to technology resources."
            ]
        },
        {
            "company": "Kerygma Digital",
            "position": "Software Engineer",
            "location": "Remote",
            "start": "June 2023",
            "end": "July 2023",
            "description": [
                "Improved service responsiveness by implementing a custom configurable time-to-live HTTP cache, reducing response latency by 60% (~400 ms) for over 5 million BibleBot users across 60,000+ Discord servers.",
                "Optimized cache usage by creating custom middleware, decreasing HTML and JSON cache usage by 99% and 39%, respectively, for improved performance.",
                "Leveraged knowledge in Java, MVC, REST, and Git to quickly adapt and contribute to the C# and ASP.NET framework."
            ]
        }
    ],
    "projects": [
        {
            "name": "Personal Website",
            "description": [
                "Researched, designed, and developed a personal portfolio website to showcase skills and learn front-end technology and design best practices, supporting Project Emory and RIDEmory's front-end/design team."
            ],
            "technologies": [
                "React + Vite",
                "TypeScript",
                "HTML/CSS",
                "Figma",
                "Git",
                "Firefox/Chrome Developer Tools"
            ]
        },
        {
            "name": "RIDEmory",
            "description": [
                "Built a comprehensive rideshare solution for Emory's students, featuring a self-updating database of ride information.",
                "Guided engineers through MongoDB GeoJSON indexing to filter search for nearby rides and current traffic times, enabling efficient ride matching.",
                "Utilized Java and Spring Boot to teach MVC/REST principles and promote collaboration within the project's back-end team."
            ],
            "technologies": [
                "Java/Spring Boot",
                "MongoDB Atlas",
                "Python/Flask",
                "React",
                "Figma",
                "Git",
                "Google Maps/Routes API"
            ]
        },
        {
            "name": "Voice Calculator",
            "description": [
                "Developed a hands-free calculator as a proof-of-concept for a lightweight, deployable voice-controlled application.",
                "Created modular grammar regular expressions to improve speech detection accuracy in noisy environments, ensuring reliable voice recognition."
            ],
            "technologies": [
                "Java",
                "Sphinx4",
                "MaryTTS"
            ]
        }
    ],
    "extracurriculars": [
        {
            "organization": "Project Emory",
            "position": "Cofounder/Secretary",
            "location": "Atlanta, GA",
            "start": "May 2023",
            "end": "Present",
            "description": [
                "Crafted engaging Spring Boot, MongoDB, and Git curriculum to enhance the technical proficiency of over 20 members.",
                "Provided working CS experience to over 30 students by establishing and running Emory's only open project-building club.",
                "Mentored 2 CS students through peer-programming opportunities, coursework guidance, and pre-professional advice, contributing to their overall success in software engineering."
            ]
        },
        {
            "organization": "Emory Hack4Impact",
            "position": "Software Engineer",
            "location": "Atlanta, GA",
            "start": "December 2023",
            "end": "Present",
            "description": [
                "Designed and developed an internal operations webpage for Odyssey Family Consulting Center, including an announcements board, HR service page, personal dashboard, and resources page, providing a unified employee experience.",
                "Leveraged Figma for designing pages based on client specifications and JavaScript for implementing the designed pages."
            ]
        }
    ],
    "other": [
        {
            "title": "Software",
            "content": [
                "(proficient): Java, Git, JavaScript/TypeScript, HTML/CSS, Python",
                "(familiar): Shell, C, C#, Go"
            ]
        },
        {
            "title": "Interests",
            "content": [
                "Backpacking",
                "Volleyball",
                "Technical/Modded Minecraft",
                "Linux",
                "Performance Arts (Oboe and Guitar)"
            ]
        }
    ]
}